README.md
```mermaid
erDiagram
    CATEGORIA ||--o{ PLATO : clasifica
    PLATO ||--o{ PLATO_INGREDIENTE : contiene
    INGREDIENTE ||--o{ PLATO_INGREDIENTE : participa

    CATEGORIA {
      TEXT nombre PK
    }

    PLATO {
      TEXT nombre PK
      TEXT descripcion
      TEXT dificultad
      TEXT foto
      TEXT nombre_categoria FK
    }

    INGREDIENTE {
      TEXT nombre PK
    }

    PLATO_INGREDIENTE {
      TEXT nombre_plato PK,FK
      TEXT nombre_ingrediente PK,FK
      TEXT cantidad
    }
```
